app/controllers/tasks_controller.rb

    def create
      @task = current_user.tasks.new(task_params)
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "state", "deadline", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
      if @task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "New Title"], ["updated_at", "2024-05-31 17:19:17.454216"], ["id", 14]]

    def set_task
      @task = current_user.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 7], ["LIMIT", 1]]